In [1]:
import pandas as pd
import numpy as np
import sklearn.linear_model as linear_model

In [21]:
df = pd.read_csv('hiring.csv')
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [22]:
df.experience = df.experience.fillna('zero')

In [23]:
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0       zero                    8.0                           9      50000
1       zero                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [24]:
df['test_score(out of 10)'] = df['test_score(out of 10)'].fillna(df['test_score(out of 10)'].mean())

In [25]:
from word2number import w2n

In [26]:
df.experience = df.experience.apply(lambda x:w2n.word_to_num(x))
# w2n.word_to_num()

In [29]:
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0               8.000000                           9      50000
1           0               8.000000                           6      45000
2           5               6.000000                           7      60000
3           2              10.000000                          10      65000
4           7               9.000000                           6      70000
5           3               7.000000                          10      62000
6          10               7.857143                           7      72000
7          11               7.000000                           8      80000

In [30]:
model = linear_model.LinearRegression()
trained_model = model.fit(df[['experience', 'test_score(out of 10)', 'interview_score(out of 10)']], df['salary($)'])

**Question**
* Find the salary for candidate with
1. 2yr experience, 9 test score, 6 interview score
2. 12yr experience, 10 test score, 10 interview score

In [34]:
predicted1 = trained_model.predict([[2, 9, 6]])
predicted2 = trained_model.predict([[12, 10, 10]])

In [35]:
predicted1

array([53290.89255945])

In [36]:
predicted2

array([92268.07227784])

Answer:
1. USD 53290.89
2. USD 92268.07